In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [3]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.fillna(value = 'nan')

     A    B  C
0  1.0  5.0  1
1  2.0  nan  2
2  nan  nan  3

In [8]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Groupby

In [9]:
data = {'company': ['go', 'go', 'go', 'ms', 'ms', 'or', 'or'],
       'person': ['sa', 'ha', 'ri', 'os', 'ot', 'sa', 'da'],
       'salary': [300, 200, 123, 432, 445, 532, 976]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

  company person  salary
0      go     sa     300
1      go     ha     200
2      go     ri     123
3      ms     os     432
4      ms     ot     445
5      or     sa     532
6      or     da     976

In [12]:
bycomp = df.groupby('company')

In [13]:
bycomp

In [14]:
bycomp.mean()

             salary
company
go       207.666667
ms       438.500000
or       754.000000

In [15]:
df.groupby('company').count()

         person  salary
company
go            3       3
ms            2       2
or            2       2

In [16]:
df.groupby('company').min()

        person  salary
company
go          ha     123
ms          os     432
or          da     532

In [28]:
dict_1 = {'A':'A1 B1 C1 D1'.split(), 'B': 'A2 B2 C2 D2'.split(), 'C' : 'A3 B3 C3 D3'.split()}
dict_2 = {'A':'A1 B1 C1 D1'.split(), 'B': 'A2 B2 C2 D2'.split(), 'C' : 'A3 B3 C3 D3'.split()}
dict_3 = {'A':'A1 B1 C1 D1'.split(), 'B': 'A2 B2 C2 D2'.split(), 'C' : 'A3 B3 C3 D3'.split()}

df1 = pd.DataFrame(dict_1, index = [0, 1, 2, 3])
df2 = pd.DataFrame(dict_2, index = [4, 5, 6, 7])
df3 = pd.DataFrame(dict_3, index = [8, 9, 10, 11])
df3

     A   B   C
8   A1  A2  A3
9   B1  B2  B3
10  C1  C2  C3
11  D1  D2  D3

In [29]:
pd.concat([df1, df2, df3])

     A   B   C
0   A1  A2  A3
1   B1  B2  B3
2   C1  C2  C3
3   D1  D2  D3
4   A1  A2  A3
5   B1  B2  B3
6   C1  C2  C3
7   D1  D2  D3
8   A1  A2  A3
9   B1  B2  B3
10  C1  C2  C3
11  D1  D2  D3

In [30]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    A    B    C    A    B    C
0    A1   A2   A3  NaN  NaN  NaN  NaN  NaN  NaN
1    B1   B2   B3  NaN  NaN  NaN  NaN  NaN  NaN
2    C1   C2   C3  NaN  NaN  NaN  NaN  NaN  NaN
3    D1   D2   D3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A1   A2   A3  NaN  NaN  NaN
5   NaN  NaN  NaN   B1   B2   B3  NaN  NaN  NaN
6   NaN  NaN  NaN   C1   C2   C3  NaN  NaN  NaN
7   NaN  NaN  NaN   D1   D2   D3  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A1   A2   A3
9   NaN  NaN  NaN  NaN  NaN  NaN   B1   B2   B3
10  NaN  NaN  NaN  NaN  NaN  NaN   C1   C2   C3
11  NaN  NaN  NaN  NaN  NaN  NaN   D1   D2   D3

In [31]:
keyDictDfLeft = {'A': '1 2 3 4'.split(),
             'B':'2 3 4 1'.split(),
                'Key':'A B C D'.split()}
leftDf = pd.DataFrame(keyDictDfLeft)

keyDictDfRight = {'Key':'B C D A'.split(),
                  'A': '1 2 3 4'.split(),
                  'B':'2 3 4 1'.split()
                }
rightDf = pd.DataFrame(keyDictDfRight)

In [32]:
leftDf

   A  B Key
0  1  2   A
1  2  3   B
2  3  4   C
3  4  1   D

In [33]:
rightDf

  Key  A  B
0   B  1  2
1   C  2  3
2   D  3  4
3   A  4  1

In [35]:
pd.merge(leftDf, rightDf, how = 'inner', on = 'Key')

  A_x B_x Key A_y B_y
0   1   2   A   4   1
1   2   3   B   1   2
2   3   4   C   2   3
3   4   1   D   3   4

OPERATION

In [38]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [44, 55, 66, 44], 'col3': ['a', 'B', 'F', 'AA']})
df

   col1  col2 col3
0     1    44    a
1     2    55    B
2     3    66    F
3     4    44   AA

In [40]:
df['col2'].unique()

array([44, 55, 66], dtype=int64)

In [41]:
df['col2'].nunique()

3

In [42]:
df['col2'].value_counts()

44    2
55    1
66    1
Name: col2, dtype: int64

In [47]:
df[(df['col1'] >= 2) & (df['col3'] == 'a')]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [50]:
def user_gen(x):
    current_value = x
    print(f'current value stored in this position: {current_value}')
    print('Enter 1 if you want to change current value and 0 if it\'s ok ')
    user_wants = input()
    if user_wants == '1':
        print('>>>', end = '')
        try:
            return int(input())
        except:
            return input()
    else:
        return current_value

In [52]:
df['col1'].apply(user_gen)

current value stored in this position: 1
Enter 1 if you want to change current value and 0 if it's ok
1
>>>12
current value stored in this position: 2
Enter 1 if you want to change current value and 0 if it's ok
1
>>>A
A
current value stored in this position: 3
Enter 1 if you want to change current value and 0 if it's ok
0
current value stored in this position: 4
Enter 1 if you want to change current value and 0 if it's ok
0

0    12
1     A
2     3
3     4
Name: col1, dtype: object

In [54]:
df['col3'].apply(len)

0    1
1    1
2    1
3    2
Name: col3, dtype: int64

In [61]:
df['col2'].apply(lambda x: x**2)

0    1936
1    3025
2    4356
3    1936
Name: col2, dtype: int64

In [63]:
df.drop('col1', axis = 1)

   col2 col3
0    44    a
1    55    B
2    66    F
3    44   AA

In [64]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [66]:
df.columns[1]

'col2'

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [67]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1    44    a
3     4    44   AA
1     2    55    B
2     3    66    F

In [68]:
df.sort_values(by = 'col3')

   col1  col2 col3
3     4    44   AA
1     2    55    B
2     3    66    F
0     1    44    a

In [69]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64